{
  "name": "Wind Form",
  "type": "power",
  "folder": "puIw6OOQC1p8n30u",
  "img": "systems/swade/assets/icons/power.svg",
  "system": {
    "description": "This spell affects the caster and up to one willing target per caster rank, causing them to become misty and translucent. While in this form the creatures no longer benefit from physical armor (either worn or natural), cannot use or benefit from any supernatural abilities, cannot make any physical attacks, cannot manipulate or activate physical objects, and cannot cast any spells that require speaking, gestures, or physical items.\n Each creature gains Flight with Pace 2 and Climb 3, which they may increase to Pace 120 and Climb\n\n-1 if moving more or less in a straight line, but theycannotrunoruseanyotherformof movement. They can pass through any opening that isn't airtight, but cannot move through liquid, and areblownaroundbyheavywinds. The creatures also become immune to poison, no longer suffer additional damage from Called Shots, andgainPhysicalResistance;theysuffer-2 damage from physical attacks except those caused bymagicweapons.PhysicalResistancesfrom different sources do not stack, if more than one\napplies use whichever is better.\n Those affected by this spell may individually change back and forth between their normal and vaporous form, but the transformation takes 5 rounds to complete in each direction. For the last minute of the spell, each creature automatically descends at the rate of 12\" per round (although they may descend faster if they wish).",
    "source": "Savage Vancian Magic",
    "range": "Touch",
    "rank": "Veteran (Priest) or Heroic (Shaman)",
    "duration": "3 hours per caster rank, dismiss early as a normal action",
    "notes": "",
    "swid": "wind-form",
    "additionalStats": {},
    "choiceSets": [],
    "actions": {
      "trait": "",
      "traitMod": "",
      "dmgMod": "",
      "additional": {}
    },
    "bonusDamageDie": 6,
    "bonusDamageDice": 1,
    "activities": [],
    "favorite": false,
    "templates": {
      "cone": false,
      "stream": false,
      "small": false,
      "medium": false,
      "large": false
    },
    "pp": 0,
    "damage": "",
    "trapping": "Direct and Beneficial",
    "arcane": "",
    "ap": 0,
    "innate": false,
    "modifiers": []
  },
  "_id": "cpTIQ55s9rTUgPbh",
  "effects": [],
  "sort": 0,
  "ownership": {
    "default": 0,
    "26zedh1nuCLjFH0V": 3
  },
  "flags": {},
  "_stats": {
    "compendiumSource": null,
    "duplicateSource": null,
    "coreVersion": "12.331",
    "systemId": "swade",
    "systemVersion": "4.4.2",
    "createdTime": 1744155785944,
    "modifiedTime": 1744155785944,
    "lastModifiedBy": "26zedh1nuCLjFH0V"
  },
  "_key": "!items!cpTIQ55s9rTUgPbh"
}
