{
  "name": "Transfer Object",
  "type": "power",
  "folder": "puIw6OOQC1p8n30u",
  "img": "systems/swade/assets/icons/power.svg",
  "system": {
    "description": "This spell transports a single object weighing up to 150 pounds per caster rank to a specified location on the same plane of existence, with a maximum range of 300 miles per caster rank.\n If you roll 1 on the spellcasting die and the spell is successfully cast, draw an action card; on Clubs the object arrives off-target. If you're very familiar with the destination you may draw two cards and choose which to keep. Should the destination no longer exists, or have been completely altered since last you saw it, the object automatically arrives off- target.\n When the object arrives off-target, consult the rank of the action card to determine what happened: a face card indicates that it arrives in a completely different location that looks similar; 6-\n10 indicates that it arrives safely in a random location (typically d100% of the distance you wished to send it, in a random direction, relative to the desired destination); 2-5 also indicates that it arrives in a random location, but it suffers 2d6 damage.\n Alternatively, rather than sending the object to a location on the same plane of existence, you can send it to the ethereal plane if you wish; the area from which it was teleported radiates faint magic, and a Dispel Magic spell brings the object back.",
    "source": "Savage Vancian Magic",
    "range": "Touch",
    "rank": "Heroic (Mage)",
    "duration": "Instant",
    "notes": "",
    "swid": "transfer-object",
    "additionalStats": {},
    "choiceSets": [],
    "actions": {
      "trait": "",
      "traitMod": "",
      "dmgMod": "",
      "additional": {}
    },
    "bonusDamageDie": 6,
    "bonusDamageDice": 1,
    "activities": [],
    "favorite": false,
    "templates": {
      "cone": false,
      "stream": false,
      "small": false,
      "medium": false,
      "large": false
    },
    "pp": 0,
    "damage": "",
    "trapping": "Direct",
    "arcane": "",
    "ap": 0,
    "innate": false,
    "modifiers": []
  },
  "_id": "xTPUdcsophOdWI5E",
  "effects": [],
  "sort": 0,
  "ownership": {
    "default": 0,
    "26zedh1nuCLjFH0V": 3
  },
  "flags": {},
  "_stats": {
    "compendiumSource": null,
    "duplicateSource": null,
    "coreVersion": "12.331",
    "systemId": "swade",
    "systemVersion": "4.4.2",
    "createdTime": 1744155785944,
    "modifiedTime": 1744155785944,
    "lastModifiedBy": "26zedh1nuCLjFH0V"
  },
  "_key": "!items!xTPUdcsophOdWI5E"
}
